# Assignment 1 -- SQL 1

It does not matter whether you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

* COMP 430:  Complete Problems 1-4.  (Your final score will be multiplied by 1.25 to be out of 100 points.)
* COMP 533:  Complete Problems 1-5.

**Specify which course you are in, COMP 430 or 533: 533

First, the standard preliminary steps.  For security, don't include your ricedb password.

In [15]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
%sql postgresql://ricedb:zt940107@localhost/postgres

u'Connected: ricedb@postgres'

## Problem 1 (20 points)

We are modeling course enrollments.  Courses can have multiple sections.  Students and sections are in a many-to-many relationship --- students can be in many course sections, and course sections can have many students.  Instructors and sections are in a many-to-many relationship --- instructors can teach multiple course sections, and course sections can have many instructors.

The following schemas show one way to model these ideas.  We'll ignore other issues, such as prerequisites, course enrollment caps, minimum and maximum credit hours per student, and restricting students from taking multiple sections of the same course.

Schemas:
* Person (<u>p_id</u>, first_name, last_name) --- Used for both students and instructors.
* Enrollment (<u>p_id</u>, <u>crn</u>)
* Section (<u>crn</u>, c_id, section)
* Course (<u>c_id</u>, title, dept_code, course_number, credit_hours)
* SectionInstructor (<u>crn</u>, <u>instructor</u>)

Provide SQL code to
* DROP existing versions of the tables, and
* CREATE the described tables, including primary keys and foreign keys.
    - Choose column types that are appropriate for the data described in the next problem.
      You can assume that courses have a single numeric value for their credit hours.
    - Choose appropriate foreign keys.

In [20]:
%%sql
DROP TABLE IF EXISTS Person, Enrollment, Section, Course, SectionInstructor;

CREATE TABLE Person (
    p_id VARCHAR(50),
    first_name VARCHAR(50),
    last_name VARCHAR(50),   
    PRIMARY KEY (p_id)
);

CREATE TABLE Enrollment (
    p_id VARCHAR(50),
    crn  INTEGER,
    PRIMARY KEY (p_id,crn),
    FOREIGN KEY (p_id) REFERENCES Person(p_id) 
    ON DELETE CASCADE
);

CREATE TABLE Course (
    c_id INTEGER NOT NULL,
    title VARCHAR(50),
    dept_code CHAR(4),                           
    course_number CHAR(3),                        
    credit_hours FLOAT,                       
    PRIMARY KEY (c_id)
);

CREATE TABLE Section (
    crn  INTEGER,
    c_id INTEGER,
    section CHAR(3),
    PRIMARY KEY (crn),
    FOREIGN KEY (c_id) REFERENCES Course(c_id) 
    ON DELETE CASCADE
);

CREATE TABLE SectionInstructor(
    crn INTEGER,
    instructor VARCHAR(50),
    PRIMARY KEY (crn, instructor),
    FOREIGN KEY(crn) REFERENCES Section(crn)
    ON DELETE CASCADE,
    FOREIGN KEY(instructor) REFERENCES Person(p_id)
);

Done.
Done.
Done.
Done.
Done.
Done.

[]

## Problem 2 (20 points)

Provide SQL code to add data to the tables.

For the Section, Course, and SectionInstructor tables, use the data from [Rice's Spring 2017 schedule](https://courses.rice.edu/admweb/swkscat.main) for the Computer Science courses COMP 1XX-4XX, excluding the variable-credit COMP 290, 390, and 490, making up appropriate `c_id`'s.  Enter the instructors for these courses in the Person table, making up appropriate `p_id`'s.

Use the following student schedules, making up appropriate student `p_id`'s.  Obviously, these schedules break some of the real-world prerequisite constraints that we are ignoring.
* John Doe is taking COMP 100, COMP 130, and COMP 321 section 3.
* Jane Smith is taking COMP 182 section 2, COMP 310, and COMP 321 section 1.
* William Jones is taking COMP 130, COMP 430, and COMP 321 section 2.
* Mary Williams is taking COMP 427.
* Matt Foster is not taking any courses.

In [23]:
%%sql
delete from course where 1=1;
delete from person where 1=1;


INSERT INTO Course (c_id, dept_code, course_number, title, credit_hours) values
--c_id dept_code, course_number,title , credit_hours,
(1,'COMP','100','INTRO COMPUTING & INFO SYS',3),
(2,'COMP','130','ELEMENTS OF ALGORITHMS & COMP',4),
(3,'COMP','182','ALGORITHMIC THINKING',4),
(4,'COMP','310','ADV OBJECT-ORIENTED PROG',4),
(5,'COMP','321','INTRO TO COMPUTER SYSTEMS',4),
(6,'COMP','322','FUNDAMENTALS OF PARALLEL PROG',4),
(7,'COMP','345','INTRO TO COMPUTER VISION',3),
(8,'COMP','410','SOFTWARE ENGINEER METHODOLOGY',4),
(9,'COMP','411','PRINCIPLES OF PROG LANGUAGES',4),
(10,'COMP','421','OP SYS/CONCURRENT PROGRAMMING',4),
(11,'COMP','422','PARALLEL COMPUTING',4),
(12,'COMP','427','INTRO TO COMPUTER SECURITY',3),
(13,'COMP','430','INTRO TO DATABASE SYSTEMS',4),
(14,'COMP','431','WEB DEVELOPMENT',3),
(15,'COMP','441','LARGE-SCALE MACHINE LEARNING',3),
(16,'COMP','460','ADV COMPUTER GRAPHICS',4),
(17,'COMP','477','INTRO TO CRYPTOGRAPHY',3),
(18,'COMP','481','AUTOMATA/FORMAL LANG/COMPUTING',3),
(19,'COMP','491','UTER SCIENCE TEACHING',3);

INSERT INTO Section(crn,c_id,section) values
(22468,1,'001'),
(22582,1,'002'),
(20425,2,'001'),
(21510,2,'002'),
(23948,4,'001'),
(21256,5,'001'),
(21465,5,'002'),
(22615,5,'003'),
(20444,6,'001'),
(22687,7,'001'),
(21255,8,'001'),
(20988,9,'001'),
(20159,10,'001'),
(20160,11,'001'),
(21500,12,'001'),
(20665,13,'001'),
(22502,14,'001'),
(22230,15,'001'),
(20524,16,'001'),
(24298,17,'001'),
(21490,18,'001'),
(20162,19,'001');




INSERT INTO Person values
--insert student
('S001','John','Doe'),
('S002','Jane','Smith'),
('S003','Willian','Jones'),
('S004','Mary','Williams'),
('S005','Matt','Foster'),
--insert instructor
('T001','Joyner', 'Mackale R.'),
('T002','Greiner','John D.'),
('T003','Nakhleh','Luay'),
('T004','Wong', 'Stephen B.'),
('T005','Cox', 'Alan L.'),
('T006','Sarkar', 'Vivek, Joyner'),
('T007','Veeraraghavan', 'Ashok'),
('T009','Cartwright', 'Robert S.'),
('T010','Johnson', 'David B.'),
('T011','Mellor-Crummey', 'John M.'),
('T012','Wallach', 'Dan S.'),
('T013','Greiner', 'John D.'),
('T014','Pollack', 'Scott E.'),
('T015','Shrivastava', 'Anshumali'),
('T016','Warren', 'Joe D.'),
('T017','Pereira', 'Olivier'),
('T018','Goldman', 'Ronald N.'),
('T019','Sarkar', 'Vivek');

INSERT INTO SectionInstructor values 
(22468,'T001'),
(22582,'T002'),
(20425,'T003'),
(21510,'T003'),
(23948,'T004'),
(21256,'T005'),
(21465,'T005'),
(22615,'T005'),
(20444,'T006'),
(22687,'T007'),
(21255,'T005'),
(20988,'T009'),
(20159,'T010'),
(20160,'T011'),
(21500,'T012'),
(20665,'T013'),
(22502,'T014'),
(22230,'T015'),
(20524,'T016'),
(24298,'T017'),
(21490,'T018'),
(20162,'T019');

INSERT INTO Enrollment values
('S001',22468),
('S001',22582),
('S001',22615),
('S002',21510),
('S002',23948),
('S003',21256),
('S003',22582),
('S003',20665),
('S003',21465),
('S004',21500);

19 rows affected.
23 rows affected.
19 rows affected.
22 rows affected.
23 rows affected.
22 rows affected.
10 rows affected.

[]

## Problem 3 (20 points)

Create a query that shows what instructors are teaching what courses.  More specifically, the results should have the department code, course number, and instructor's names.  There should be no duplicate rows, even if an instructor teaches multiple sections of the same course.  The results should be sorted by the course information, i.e., alphabetically by department code and then course number.

In [30]:
%%sql
SELECT DISTINCT Course.dept_code,Course.course_number,Person.first_name,Person.last_name
FROM Course 
INNER JOIN Section ON Course.c_id = Section.c_id
INNER JOIN SectionInstructor ON Section.crn = SectionInstructor.crn
INNER JOIN Person ON SectionInstructor.instructor = Person.p_id
ORDER BY dept_code,course_number;

19 rows affected.

[(u'COMP', u'100', u'Greiner', u'John D.'),
 (u'COMP', u'100', u'Joyner', u'Mackale R.'),
 (u'COMP', u'130', u'Nakhleh', u'Luay'),
 (u'COMP', u'310', u'Wong', u'Stephen B.'),
 (u'COMP', u'321', u'Cox', u'Alan L.'),
 (u'COMP', u'322', u'Sarkar', u'Vivek, Joyner'),
 (u'COMP', u'345', u'Veeraraghavan', u'Ashok'),
 (u'COMP', u'410', u'Cox', u'Alan L.'),
 (u'COMP', u'411', u'Cartwright', u'Robert S.'),
 (u'COMP', u'421', u'Johnson', u'David B.'),
 (u'COMP', u'422', u'Mellor-Crummey', u'John M.'),
 (u'COMP', u'427', u'Wallach', u'Dan S.'),
 (u'COMP', u'430', u'Greiner', u'John D.'),
 (u'COMP', u'431', u'Pollack', u'Scott E.'),
 (u'COMP', u'441', u'Shrivastava', u'Anshumali'),
 (u'COMP', u'460', u'Warren', u'Joe D.'),
 (u'COMP', u'477', u'Pereira', u'Olivier'),
 (u'COMP', u'481', u'Goldman', u'Ronald N.'),
 (u'COMP', u'491', u'Sarkar', u'Vivek')]

## Problem 4 (20 points)

An instructor would want to see all of his or her rosters.  Write a query where the results have the section information (CRN, department code, course number, section, and title) for every section taught by this particular instructor followed by the student's information (ID, first, and last name) for every student in the course.  The results should be sorted by the crn, then the student's last name and first name.

Since we have have not yet considered how application code could pass arguments to the SQL code, we'll hard-code a single instructor's `p_id` or name into the query's `WHERE` clause.

In [46]:
%%sql
SELECT Section.crn,Course.dept_code,Course.course_number,Section.section,Course.title,Person.p_id,Person.first_name,Person.last_name
FROM Section
INNER JOIN SectionInstructor ON SectionInstructor.crn = Section.crn 
INNER JOIN Enrollment ON Enrollment.crn = SectionInstructor.crn
INNER JOIN Person ON Person.p_id = Enrollment.p_id
INNER JOIN Course ON Section.c_id = Course.c_id
WHERE SectionInstructor.instructor = 'T001'

1 rows affected.

[(22468, u'COMP', u'100', u'001', u'INTRO COMPUTING & INFO SYS', u'S001', u'John', u'Doe')]

## Problem 5 (20 points) -- for COMP 533 students

Is it possible to have a table that has a foreign key that references the same table?

If so, give a SQL example table definition and a text description of why or example of when this might be useful.  (Add a code cell and a Markdown cell below.)

If not, describe why not.  (Add a Markdown cell below.)

It is possible to have a table that has a foreign key that references the same table.
For example, students should join a team to finish their assignment. A group table would record the student and his/her team's leader. The leader should also be a student in this class. So the foreign key is the leader's id and it should reference the primary key which is the student's id.
Group(stu_id,leader_id)

In [54]:
%%sql
DROP TABLE IF EXISTS group1;
CREATE TABLE Group1(
stu_id VARCHAR(50),
leader_id VARCHAR(50),
PRIMARY KEY(stu_id),
FOREIGN KEY (leader_id) REFERENCEs Group1(stu_id)
);

Done.
Done.

[]